app/Models/AdminModel.php

    public function getAdminByUsername($username)
    {
        return $this->where('username', $username)->first(); // Mengambil admin berdasarkan username
---
SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1