app/Models/FileFacultyModel.php

SELECT *
FROM `files`
WHERE `faculty` = 'FE'
---
    public function getFilesByFaculty($faculty_name)
    {
        return $this->where('faculty', $faculty_name)->findAll(); // Mengambil semua file untuk fakultas tertentu