app/Models/FileModel.php

public function searchFiles($keyword)
{
    return $this->builder('files') // Pastikan nama tabel sesuai
        ->groupStart() // Memulai grup untuk kondisi OR
            ->like('filename', $keyword)
            ->orLike('file_path', $keyword)
            ->orLike('faculty', $keyword)
        ->groupEnd() // Mengakhiri grup
        ->get()
        ->getResultArray();
---
SELECT *
FROM `files`
WHERE   (
`filename` LIKE '%FE%' ESCAPE '!'
OR  `file_path` LIKE '%FE%' ESCAPE '!'
OR  `faculty` LIKE '%FE%' ESCAPE '!'
 )